In [10]:
import pandas as pd
import numpy as np

df = pd.read_excel(open('./Neo_temp.xlsx','rb'), sheet_name='Sheet1')
df.head()

      name   company
0  vincent   dfdvvvb
1     gabe  Facebook
2   kelsey      XYQQ
3  juliane     udbdj

In [11]:
df['Individual_query']=""
df['Company_query']=""
df['Rel_query']=""
df

      name   company Individual_query Company_query Rel_query
0  vincent   dfdvvvb
1     gabe  Facebook
2   kelsey      XYQQ
3  juliane     udbdj

In [12]:
for index, row in df.iterrows():  
    print(index,'------',row['company'])
    df['Individual_query'][index]="MERGE(n:Individual {name:'%s'})"%(row['name'])
    df['Company_query'][index]="MERGE(n:Company {name:'%s'})"%(row['company'])
    df['Rel_query'][index]="MATCH (n1:Individual {name:'%s'}),(n2:Company {name:'%s'}) MERGE (n1)-[r:WORKS_IN]->(n2)"%(row['name'],row['company'])
df

0 ------ dfdvvvb
1 ------ Facebook
2 ------ XYQQ
3 ------ udbdj

,name,company,Individual_query,Company_query,Rel_query
0,vincent,dfdvvvb,MERGE(n:Individual {name:'vincent'}),MERGE(n:Company {name:'dfdvvvb'}),"MATCH (n1:Individual {name:'vincent'}),(n2:Com..."
1,gabe,Facebook,MERGE(n:Individual {name:'gabe'}),MERGE(n:Company {name:'Facebook'}),"MATCH (n1:Individual {name:'gabe'}),(n2:Compan..."
2,kelsey,XYQQ,MERGE(n:Individual {name:'kelsey'}),MERGE(n:Company {name:'XYQQ'}),"MATCH (n1:Individual {name:'kelsey'}),(n2:Comp..."
3,juliane,udbdj,MERGE(n:Individual {name:'juliane'}),MERGE(n:Company {name:'udbdj'}),"MATCH (n1:Individual {name:'juliane'}),(n2:Com..."

## Ingest into Graph from here

In [13]:
# How to install this package? type this "pip install neo4j-driver" in your terminal  ==> then run the rest
from neo4j.v1 import GraphDatabase

uri = "bolt://localhost:7687"
driver = GraphDatabase.driver(uri, auth=("neo4j", "mjgh2765"))

In [14]:
for index, row in df.iterrows():
    with driver.session() as session:      
        result = session.run(row['Individual_query'])
        result = session.run(row['Company_query'])
        result = session.run(row['Rel_query'])